### Terraform Plan Output Part # 1
  #### Terraform Format and Style 🖌`success`
  #### Terraform Initialization ⚙️`success`
  #### Terraform Validation 🤖`success`
  #### Terraform Plan 📖`success`
  <details><summary>Show Plan</summary>
  
  ```terraform

  
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
-/+ destroy and then create replacement
 <= read (data resources)

Terraform will perform the following actions:

  # azurerm_log_analytics_workspace.rsi-law will be created
  + resource "azurerm_log_analytics_workspace" "rsi-law" {
      + allow_resource_only_permissions = true
      + id                              = (known after apply)
      + internet_ingestion_enabled      = true
      + internet_query_enabled          = true
      + local_authentication_disabled   = false
      + location                        = "uksouth"
      + name                            = "rsi-dev-law"
      + primary_shared_key              = (sensitive value)
      + resource_group_name             = "rsi-dev-rg"
      + retention_in_days               = 7
      + secondary_shared_key            = (sensitive value)
      + sku                             = "Free"
      + workspace_id                    = (known after apply)
    }

  # module.fe-loadbalancer.data.azurerm_resource_group.azlb will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "azurerm_resource_group" "azlb" {
      + id         = (known after apply)
      + location   = (known after apply)
      + managed_by = (known after apply)
      + name       = "rsi-dev-rg"
      + tags       = (known after apply)
    }

  # module.nsg-be.azurerm_network_security_rule.custom_rules[0] must be replaced
-/+ resource "azurerm_network_security_rule" "custom_rules" {
      ~ description                                = "FrontendAllowSSH" -> "Allow Local Networks"
      - destination_address_prefix                 = "*" -> null
      ~ destination_address_prefixes               = [
          + "10.1.0.0/16",
        ]
      - destination_application_security_group_ids = [] -> null
      ~ destination_port_ranges                    = [
          - "22",
          + "0-65535",
        ]
      ~ id                                         = "/subscriptions/d2e80279-0f23-4ab1-a876-0206dad47c40/resourceGroups/rsi-dev-rg/providers/Microsoft.Network/networkSecurityGroups/rsi-nsg-backend/securityRules/SSH-FE" -> (known after apply)
      ~ name                                       = "SSH-FE" -> "VirtualNetwork" # forces replacement
      ~ protocol                                   = "Tcp" -> "*"
      - source_address_prefix                      = "10.0.2.0/24" -> null
      ~ source_address_prefixes                    = [
          + "10.1.0.0/16",
        ]
      - source_application_security_group_ids      = [] -> null
      - source_port_ranges                         = [] -> null
        # (6 unchanged attributes hidden)
    }

  # module.nsg-be.azurerm_network_security_rule.custom_rules[1] must be replaced
-/+ resource "azurerm_network_security_rule" "custom_rules" {
      - destination_address_prefixes               = [] -> null
      - destination_application_security_group_ids = [] -> null
      ~ destination_port_ranges                    = [
          - "0-65535",
          + "22",
        ]
      ~ id                                         = "/subscriptions/d2e80279-0f23-4ab1-a876-0206dad47c40/resourceGroups/rsi-dev-rg/providers/Microsoft.Network/networkSecurityGroups/rsi-nsg-backend/securityRules/ICMP-FE" -> (known after apply)
      ~ name                                       = "ICMP-FE" -> "SSH-FE" # forces replacement
      ~ priority                                   = 102 -> 201
      ~ protocol                                   = "Icmp" -> "Tcp"
      - source_address_prefixes                    = [] -> null
      - source_application_security_group_ids      = [] -> null
      - source_port_ranges                         = [] -> null
        # (8 unchanged attributes hidden)
    }

  # module.nsg-be.azurerm_network_security_rule.custom_rules[2] must be replaced
-/+ resource "azurerm_network_security_rule" "custom_rules" {
      ~ description                                = "FrontendAllowMySQL" -> "FrontendAllowSSH"
      - destination_address_prefixes               = [] -> null
      - destination_application_security_group_ids = [] -> null
      ~ destination_port_ranges                    = [
          - "3306",
          + "0-65535",
        ]
      ~ id                                         = "/subscriptions/d2e80279-0f23-4ab1-a876-0206dad47c40/resourceGroups/rsi-dev-rg/providers/Microsoft.Network/networkSecurityGroups/rsi-nsg-backend/securityRules/MySQL-DB-FE" -> (known after apply)
      ~ name                                       = "MySQL-DB-FE" -> "ICMP-FE" # forces replacement
      ~ priority                                   = 201 -> 202
      ~ protocol                                   = "Tcp" -> "Icmp"
      - source_address_prefixes                    = [] -> null
      - source_application_security_group_ids      = [] -> null
      - source_port_ranges                         = [] -> null
        # (7 unchanged attributes hidden)
    }

  # module.nsg-be.azurerm_network_security_rule.custom_rules[3] must be replaced
-/+ resource "azurerm_network_security_rule" "custom_rules" {
      ~ access                                     = "Deny" -> "Allow"
      ~ description                                = "default-deny" -> "FrontendAllowMySQL"
      - destination_address_prefixes               = [] -> null
      - destination_application_security_group_ids = [] -> null
      ~ destination_port_ranges                    = [
          - "0-65535",
          + "3306",
        ]
      ~ id                                         = "/subscriptions/d2e80279-0f23-4ab1-a876-0206dad47c40/resourceGroups/rsi-dev-rg/providers/Microsoft.Network/networkSecurityGroups/rsi-nsg-backend/securityRules/DENY" -> (known after apply)
      ~ name                                       = "DENY" -> "MySQL-DB-FE" # forces replacement
      ~ priority                                   = 4096 -> 301
      ~ source_address_prefix                      = "*" -> "10.0.2.0/24"
      - source_address_prefixes                    = [] -> null
      - source_application_security_group_ids      = [] -> null
      - source_port_ranges                         = [] -> null
        # (6 unchanged attributes hidden)
    }

  # module.nsg-be.azurerm_network_security_rule.custom_rules[4] will be created
  + resource "azurerm_network_security_rule" "custom_rules" {
      + access                      = "Deny"
      + description                 = "default-deny"
      + destination_address_prefix  = "*"
      + destination_port_ranges     = [
          + "0-65535",
        ]
      + direction                   = "Inbound"
      + id                          = (known after apply)
      + name                        = "DENY"
      + network_security_group_name = "rsi-nsg-backend"
      + priority                    = 4096
      + protocol                    = "Tcp"
      + resource_group_name         = "rsi-dev-rg"
      + source_address_prefix       = "*"
      + source_port_range           = "*"
    }

  # module.nsg-fe.azurerm_network_security_rule.custom_rules[0] must be replaced
-/+ resource "azurerm_network_security_rule" "custom_rules" {
      ~ description                                = "AzureLoadBalancerAllowed" -> "Allow Local Networks"
      - destination_address_prefix                 = "*" -> null
      ~ destination_address_prefixes               = [
          + "10.0.0.0/16",
        ]
      - destination_application_security_group_ids = [] -> null
      ~ id                                         = "/subscriptions/d2e80279-0f23-4ab1-a876-0206dad47c40/resourceGroups/rsi-dev-rg/providers/Microsoft.Network/networkSecurityGroups/rsi-nsg-frontend/securityRules/AzureLoadBalancer" -> (known after apply)
      ~ name                                       = "AzureLoadBalancer" -> "VirtualNetwork" # forces replacement
      ~ protocol                                   = "Tcp" -> "*"
      - source_address_prefix                      = "AzureLoadBalancer" -> null
      ~ source_address_prefixes                    = [
          + "10.0.0.0/16",
        ]
      - source_application_security_group_ids      = [] -> null
      - source_port_ranges                         = [] -> null
        # (7 unchanged attributes hidden)
    }

  # module.nsg-fe.azurerm_network_security_rule.custom_rules[1] must be replaced
-/+ resource "azurerm_network_security_rule" "custom_rules" {
      ~ access                                     = "Deny" -> "Allow"
      ~ description                                = "default-deny" -> "AzureLoadBalancerAllowed"
      - destination_address_prefixes               = [] -> null
      - destination_application_security_group_ids = [] -> null
      ~ id                                         = "/subscriptions/d2e80279-0f23-4ab1-a876-0206dad47c40/resourceGroups/rsi-dev-rg/providers/Microsoft.Network/networkSecurityGroups/rsi-nsg-frontend/securityRules/DENY" -> (known after apply)
      ~ name                                       = "DENY" -> "AzureLoadBalancer" # forces replacement
      ~ priority                                   = 4096 -> 201
      ~ source_address_prefix                      = "*" -> "AzureLoadBalancer"
      - source_address_prefixes                    = [] -> null
      - source_application_security_group_ids      = [] -> null
      - source_port_ranges                         = [] -> null
        # (7 unchanged attributes hidden)
    }

  # module.nsg-fe.azurerm_network_security_rule.custom_rules[2] will be created
  + resource "azurerm_network_security_rule" "custom_rules" {
      + access                      = "Deny"
      + description                 = "default-deny"
      + destination_address_prefix  = "*"
      + destination_port_ranges     = [
          + "0-65535",
        ]
      + direction                   = "Inbound"
      + id                          = (known after apply)
      + name                        = "DENY"
      + network_security_group_name = "rsi-nsg-frontend"
      + priority                    = 4096
      + protocol                    = "Tcp"
      + resource_group_name         = "rsi-dev-rg"
      + source_address_prefix       = "*"
      + source_port_range           = "*"
    }

Plan: 9 to add, 0 to change, 6 to destroy.

  ```
  </details>
  
  *Pusher: @MartyFox, Action: `pull_request`, Working Directory: `terraform`, Workflow: `Terraform Pull Request Plan`*